# Data Cleaning & Transformation

## Import Data

In [1]:
import pandas as pd

housing1 = pd.read_csv("datasets/raw/Housing Prices Imputed.csv")
housing2 = pd.read_csv("datasets/raw/Housing Prices Philippines Lamudi.csv")

In [2]:
housing1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Index                      2999 non-null   int64
 1   Title                      2924 non-null   object
 2   Bathrooms                  2999 non-null   float64
 3   Bedrooms                   2999 non-null   int64
 4   Car Spaces                 2999 non-null   int64
 5   Floor area (m²)            2917 non-null   float64
 6   Land Size (m²)             2844 non-null   float64
 7   Subdivision name           1887 non-null   object
 8   Block and Lot/Unit Number  1175 non-null   object
 9   Build (Year)               511 non-null    float64
 10  Rooms (total)              2999 non-null   float64
 11  Price                      2924 non-null   float64
dtypes: float64(6), int64(3), object(3)
memory usage: 281.3+ KB

In [3]:
housing2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Unnamed: 0                 2999 non-null   int64
 1   Title                      2924 non-null   object
 2   Bathrooms                  2238 non-null   float64
 3   Bedrooms                   2275 non-null   float64
 4   Car Spaces                 1211 non-null   float64
 5   Floor area (m²)            2917 non-null   float64
 6   Land Size (m²)             2844 non-null   float64
 7   Subdivision name           1887 non-null   object
 8   Block and Lot/Unit Number  1175 non-null   object
 9   Build (Year)               511 non-null    float64
 10  Rooms (total)              508 non-null    float64
 11  Price                      2924 non-null   float64
dtypes: float64(8), int64(1), object(3)
memory usage: 281.3+ KB

Housing dataset from Dotproperty contains title of the posting, land area, usable area, floors, beds, baths, and price. Whereas the one from Lamudi contains Unnamed: 0, title, bathrooms, bedrooms, car spaces, floor area, land size, subdivision name, block and lot/unit number, build, rooms and price. Both datasets does not have the same amount of columns so we have to drop some columns and change datatypes of some columns before merging.

We will also delete duplicates and handle null value later.

## Housing 1

In [4]:
housing1.head(3)

,Index,Title,Bathrooms,Bedrooms,Car Spaces,Floor area (m²),Land Size (m²),Subdivision name,Block and Lot/Unit Number,Build (Year),Rooms (total),Price
0,0,Natalie 3BR Single Detached House for Sale in ...,3.0,3,1,123.8,140.0,West Beverly Hills,NaN,NaN,1.0,5493461.0
1,1,Townhouse with 2 Bedrooms for Sale at Hana Sou...,2.0,2,0,38.0,36.0,Hana South,Lyca model,NaN,1.0,1918427.0
2,2,RFO 1BR 2-Storey Rowhouse for Sale at Marytown...,1.0,1,0,46.6,67.0,Marytown Place,Blk1 Lot23 (ROSE-INNER),2019.0,1.0,1700404.0

### Remove duplicates

In [5]:
print("Pre-duplicate deletion shape: ",housing1.shape)

Pre-duplicate deletion shape:  (2999, 12)

In [6]:
# Check duplicates, and remove them

print("Duplicate rows: ",housing1.duplicated().sum())

housing1.drop_duplicates(inplace=True)

print("Current shape: ", housing1.shape)

Duplicate rows:  0
Current shape:  (2999, 12)

### Remove unused columns

In [7]:
print("Columns:", housing1.columns, end="\n\n")

Columns: Index(['Index', 'Title', 'Bathrooms', 'Bedrooms', 'Car Spaces',
       'Floor area (m²)', 'Land Size (m²)', 'Subdivision name',
       'Block and Lot/Unit Number', 'Build (Year)', 'Rooms (total)', 'Price'],
      dtype='object')

We will be removing Index since it is just an index of the CSV file, Subdivision name, Block and Lot/Unit Number and lastly the Build (Year) and Rooms (total) due to the amount of missing values it has.

In [8]:
housing1.drop(columns=["Index", "Subdivision name", "Block and Lot/Unit Number", "Build (Year)", "Rooms (total)"], inplace=True)
print("New Columns:", housing1.columns)

New Columns: Index(['Title', 'Bathrooms', 'Bedrooms', 'Car Spaces', 'Floor area (m²)',
       'Land Size (m²)', 'Price'],
      dtype='object')

In [9]:
housing1

,Title,Bathrooms,Bedrooms,Car Spaces,Floor area (m²),Land Size (m²),Price
0,Natalie 3BR Single Detached House for Sale in ...,3.0,3,1,123.80,140.0,5493461.0
1,Townhouse with 2 Bedrooms for Sale at Hana Sou...,2.0,2,0,38.00,36.0,1918427.0
2,RFO 1BR 2-Storey Rowhouse for Sale at Marytown...,1.0,1,0,46.60,67.0,1700404.0
3,2-Storey 4BR House and Lot (Amanda Model) for ...,3.0,4,1,167.00,154.0,7841100.0
4,5BR House for Sale at Camella Provence in Brgy...,3.0,5,0,166.00,143.0,10151000.0
...,...,...,...,...,...,...,...
2994,"Price Reduced - 5 Bedroom,4 Bathroom Fully Fur...",4.0,5,0,372.00,300.0,16000000.0
2995,House Mediterranean Design Luxurious home For ...,4.0,4,6,350.00,1056.0,85000000.0
2996,For Sale: 2-Bedroom Danessa Single Attached Ho...,1.0,2,1,37.30,169.0,2844000.0
2997,For Sale RFO 4BR Single Detached House and Lot...,3.0,4,1,198.26,217.0,7676915.0
2998,House For Sale 3BR TH in Bloomfield Homes II-S...,1.0,3,0,86.00,72.0,2650000.0

### Rename columns

In [10]:
housing1.columns

Index(['Title', 'Bathrooms', 'Bedrooms', 'Car Spaces', 'Floor area (m²)',
       'Land Size (m²)', 'Price'],
      dtype='object')

In [11]:
# Rename the column names

housing1.columns = ["title", "bathrooms", "bedrooms", "car_spaces", "floor_area_m2", "land_size_m2", "price_php"]

housing1.columns

Index(['title', 'bathrooms', 'bedrooms', 'car_spaces', 'floor_area_m2',
       'land_size_m2', 'price_php'],
      dtype='object')

In [12]:
housing1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2924 non-null   object
 1   bathrooms      2999 non-null   float64
 2   bedrooms       2999 non-null   int64
 3   car_spaces     2999 non-null   int64
 4   floor_area_m2  2917 non-null   float64
 5   land_size_m2   2844 non-null   float64
 6   price_php      2924 non-null   float64
dtypes: float64(4), int64(2), object(1)
memory usage: 164.1+ KB

### Make Datatypes Consistent

In [13]:
housing1["bathrooms"] = housing1["bathrooms"].astype(int)

housing1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2924 non-null   object
 1   bathrooms      2999 non-null   int64
 2   bedrooms       2999 non-null   int64
 3   car_spaces     2999 non-null   int64
 4   floor_area_m2  2917 non-null   float64
 5   land_size_m2   2844 non-null   float64
 6   price_php      2924 non-null   float64
dtypes: float64(3), int64(3), object(1)
memory usage: 164.1+ KB

### Drop Null Values

In [14]:
print("Null Values Frequency:", housing1.isna().sum(), sep="\n")

housing1.dropna(inplace=True)

print("\nhousing 1 shape:", housing1.shape)

Null Values Frequency:
title             75
bathrooms          0
bedrooms           0
car_spaces         0
floor_area_m2     82
land_size_m2     155
price_php         75
dtype: int64

housing 1 shape: (2839, 7)

In [15]:
housing1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2839 entries, 0 to 2998
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2839 non-null   object
 1   bathrooms      2839 non-null   int64
 2   bedrooms       2839 non-null   int64
 3   car_spaces     2839 non-null   int64
 4   floor_area_m2  2839 non-null   float64
 5   land_size_m2   2839 non-null   float64
 6   price_php      2839 non-null   float64
dtypes: float64(3), int64(3), object(1)
memory usage: 177.4+ KB

## Housing 2

In [16]:
housing2.head(3)

,Unnamed: 0,Title,Bathrooms,Bedrooms,Car Spaces,Floor area (m²),Land Size (m²),Subdivision name,Block and Lot/Unit Number,Build (Year),Rooms (total),Price
0,0,Natalie 3BR Single Detached House for Sale in ...,3.0,3.0,1.0,123.8,140.0,West Beverly Hills,NaN,NaN,NaN,5493461.0
1,1,Townhouse with 2 Bedrooms for Sale at Hana Sou...,2.0,2.0,NaN,38.0,36.0,Hana South,Lyca model,NaN,NaN,1918427.0
2,2,RFO 1BR 2-Storey Rowhouse for Sale at Marytown...,1.0,1.0,NaN,46.6,67.0,Marytown Place,Blk1 Lot23 (ROSE-INNER),2019.0,NaN,1700404.0

### Remove duplicates

In [17]:
print("Pre-duplicate deletion shape: ",housing2.shape)

# Check duplicates, and remove them
print("Duplicate rows: ",housing2.duplicated().sum())

housing1.drop_duplicates(inplace=True)

print("Current shape: ", housing2.shape)

Pre-duplicate deletion shape:  (2999, 12)
Duplicate rows:  0
Current shape:  (2999, 12)

### Remove unused columns

In [18]:
print("Columns:", housing2.columns, end="\n\n")

housing2.drop(columns=["Unnamed: 0", "Subdivision name", "Block and Lot/Unit Number", "Build (Year)", "Rooms (total)"], inplace=True)

print("New Columns:", housing2.columns)

Columns: Index(['Unnamed: 0', 'Title', 'Bathrooms', 'Bedrooms', 'Car Spaces',
       'Floor area (m²)', 'Land Size (m²)', 'Subdivision name',
       'Block and Lot/Unit Number', 'Build (Year)', 'Rooms (total)', 'Price'],
      dtype='object')

New Columns: Index(['Title', 'Bathrooms', 'Bedrooms', 'Car Spaces', 'Floor area (m²)',
       'Land Size (m²)', 'Price'],
      dtype='object')

In [19]:
housing2.head()

,Title,Bathrooms,Bedrooms,Car Spaces,Floor area (m²),Land Size (m²),Price
0,Natalie 3BR Single Detached House for Sale in ...,3.0,3.0,1.0,123.8,140.0,5493461.0
1,Townhouse with 2 Bedrooms for Sale at Hana Sou...,2.0,2.0,NaN,38.0,36.0,1918427.0
2,RFO 1BR 2-Storey Rowhouse for Sale at Marytown...,1.0,1.0,NaN,46.6,67.0,1700404.0
3,2-Storey 4BR House and Lot (Amanda Model) for ...,3.0,4.0,1.0,167.0,154.0,7841100.0
4,5BR House for Sale at Camella Provence in Brgy...,3.0,5.0,NaN,166.0,143.0,10151000.0

### Rename columns

In [20]:
housing2.columns = ["title", "bathrooms", "bedrooms", "car_spaces", "floor_area_m2", "land_size_m2", "price_php"]

housing2.columns

Index(['title', 'bathrooms', 'bedrooms', 'car_spaces', 'floor_area_m2',
       'land_size_m2', 'price_php'],
      dtype='object')

In [21]:
housing2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2924 non-null   object
 1   bathrooms      2238 non-null   float64
 2   bedrooms       2275 non-null   float64
 3   car_spaces     1211 non-null   float64
 4   floor_area_m2  2917 non-null   float64
 5   land_size_m2   2844 non-null   float64
 6   price_php      2924 non-null   float64
dtypes: float64(6), object(1)
memory usage: 164.1+ KB

### Drop null values

Seeing as to how car_spaces has a lot of null values, let's inspect why

In [22]:
print("Null Values Frequency:", housing2.isna().sum(), sep="\n")

# Checks how many fields in Car Spaces has a value of 0
zero = housing2[housing2["car_spaces"]==0]["car_spaces"].count()
oneplus = housing2[housing2["car_spaces"]>0]["car_spaces"].count()
null = housing2["car_spaces"].isna().sum()

print("\n0:",zero)
print("1+:",oneplus)
print("Null:",null)

print(f"{zero} + {oneplus} + {null} =", zero+oneplus+null)

Null Values Frequency:
title              75
bathrooms         761
bedrooms          724
car_spaces       1788
floor_area_m2      82
land_size_m2      155
price_php          75
dtype: int64

0: 0
1+: 1211
Null: 1788
0 + 1211 + 1788 = 2999

In [23]:
housing2.head()

,title,bathrooms,bedrooms,car_spaces,floor_area_m2,land_size_m2,price_php
0,Natalie 3BR Single Detached House for Sale in ...,3.0,3.0,1.0,123.8,140.0,5493461.0
1,Townhouse with 2 Bedrooms for Sale at Hana Sou...,2.0,2.0,NaN,38.0,36.0,1918427.0
2,RFO 1BR 2-Storey Rowhouse for Sale at Marytown...,1.0,1.0,NaN,46.6,67.0,1700404.0
3,2-Storey 4BR House and Lot (Amanda Model) for ...,3.0,4.0,1.0,167.0,154.0,7841100.0
4,5BR House for Sale at Camella Provence in Brgy...,3.0,5.0,NaN,166.0,143.0,10151000.0

Let's infer that the null values has a value of zero

In [24]:
# Fill nulls into the value 0

housing2["car_spaces"].fillna(0, inplace=True)

C:\Users\ellie\AppData\Local\Temp\ipykernel_23540\825887006.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  housing2["car_spaces"].fillna(0, inplace=True)

In [25]:
# Finally dropping null values

housing2.dropna(inplace=True)

print("\nhousing 2 shape:", housing2.shape)

housing 2 shape: (2192, 7)

### Make Datatypes Consistent

In [26]:
housing2["bathrooms"] = housing2["bathrooms"].astype(int)
housing2["bedrooms"] = housing2["bedrooms"].astype(int)
housing2["car_spaces"] = housing2["car_spaces"].astype(int)

housing2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2192 entries, 0 to 2998
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2192 non-null   object
 1   bathrooms      2192 non-null   int64
 2   bedrooms       2192 non-null   int64
 3   car_spaces     2192 non-null   int64
 4   floor_area_m2  2192 non-null   float64
 5   land_size_m2   2192 non-null   float64
 6   price_php      2192 non-null   float64
dtypes: float64(3), int64(3), object(1)
memory usage: 137.0+ KB

## Merge Dataframes

In [27]:
housing = pd.concat([housing1, housing2])
print("housing shape:", housing.shape)

housing shape: (4988, 7)

## Exporting the Housing Datasets to CSV

In [28]:
housing.to_csv("datasets/processed/PH_Housing_Prices_cleaned.csv", index=False)